{
    "version": "https://jsonfeed.org/version/1",
    "title": "Abhijith",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Abhijith's personal blog.",
    "icon": "http://localhost:4000/assets/images/apple-touch-icon.png",
    "favicon": "http://localhost:4000/assets/images/favicon.png",
    "expired": false,
    
    "author":  {
        "name": "Abhijith",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "http://localhost:4000/whatsapp-rcs-gmessages/",
            "title": "WhatsApp, RCS and Google messages",
            "summary": null,
            "content_text": "Last month, Apple announced they will support RCS messages on iMessage starting next year. Many people on the internet think that it will end the blue-green bubble saga among iOS and Android users (in the US).I have a different take here. As an Android user, I know that outside the US, even iPhone users don’t care about the iMessage, as everyone uses WhatsApp as their primary messaging app. Yesterday, Google announced they have crossed 1 billion active users with RCS enabled in Google Messages. Also they have announced some interesting features coming to the app like message reactions, custom emojis from photos etc.I believe Apple’s adoption of RCS may not hurt them , but it may hurt WhatsApp. If Apple adopted the RCS and messaging between Android and iPhone users would become seamless it will lead to more people ditching WhatsApp. Meta is adding too many unwanted features to WhatsApp like the channels and moving away from the primary focus as a messaging app. Recently, I am getting a lot of business message spams too.Yeah, simply put, WhatsApp is trying to be the next Telegram.I love the Chat bubble feature on Android. I will ditch WhatsApp for sure if Apple adopted RCS as Google Messages support chat bubbles which are lacking in WhatsApp. I am not saying Google Messages is a perfect product. If Google can rectify the flaws and focus on adding more features, I hope people may start using it as their primary messenger.That said everything depends on Google, I really wish Google not killing the RCS and Messages app one fine morning.",
            "content_html": "<p>Last month, Apple announced they will support RCS messages on iMessage starting next year. Many people on the internet think that it will end the blue-green bubble saga among iOS and Android users (in the US).</p><p>I have a different take here. As an Android user, I know that outside the US, even iPhone users don’t care about the iMessage, as everyone uses WhatsApp as their primary messaging app. Yesterday, Google announced they have crossed 1 billion active users with RCS enabled in Google Messages. Also they have announced some interesting features coming to the app like message reactions, custom emojis from photos etc.</p><p>I believe Apple’s adoption of RCS may not hurt them , but it may hurt WhatsApp. If Apple adopted the RCS and messaging between Android and iPhone users would become seamless it will lead to more people ditching WhatsApp. Meta is adding too many unwanted features to WhatsApp like the channels and moving away from the primary focus as a messaging app. Recently, I am getting a lot of business message spams too.Yeah, simply put, WhatsApp is trying to be the next Telegram.</p><p>I love the Chat bubble feature on Android. I will ditch WhatsApp for sure if Apple adopted RCS as Google Messages support chat bubbles which are lacking in WhatsApp. I am not saying Google Messages is a perfect product. If Google can rectify the flaws and focus on adding more features, I hope people may start using it as their primary messenger.</p><p>That said everything depends on Google, I really wish Google not killing the RCS and Messages app one fine morning.</p>",
            "url": "http://localhost:4000/whatsapp-rcs-gmessages/",
            
            
            
            "tags": ["blog","thoughts"],
            
            "date_published": "2023-12-31T05:30:00+05:30",
            "date_modified": "2023-12-31T05:30:00+05:30",
            
                "author": "Abhijith"
            
        },
    
        {
            "id": "http://localhost:4000/fav-malayalam-movies-of-2023/",
            "title": "Favorite malayalam movies watched this year",
            "summary": null,
            "content_text": "1. Purusha PrethamKrishand’s Purusha Pretham will undoubtedly take first place on my list. I loved his previous work Aavasavyuham and when he announced Purusha Pretham, my expectations where high.The movie is  experimental in many ways, like the cinematography, story telling,music etc and the makers succeeded in not boring the audience. The performances by Jagadish and Prasanth Alexander were outstanding.2. Kannur SquadMammootty Kampany, the production house by the legendary actor Mammootty, had  only produced two films before this film and their previous productions where well-accepted by the audience.  Their third film, Kannur Squad, which came to cinemas with low hype became a blockbuster at the box-office through word of mouth. Roby Raj’s directorial debut, which is based on Kerala Police’s investigation team Kannur Squad is a well made movie with superb cinematography and background music. I watched the film in theatres and the experience was good.3. IrattaIratta is an investigative thriller  directed by Rohith Krishnan which amused me by its climax. Joju George as an actor gives a terrific performance in this film. The ending is the major positive of the movie. The film didn’t get a long run in the theatres and failed at the box-office is a sad part. This film deserved much more success in the theatre.4. FalimyI loved Falimy, its a simple yet beautiful film with many laughable moments. Jagadish, Basil, Manju Pillai and that Appooppan everyone did a great job in entertaining the audience in this movie.5. PookkaalamGanesh Raj’s Pookkaalam is a small movie which loved for its simplicity. Vijayaraghavan did an amazing performance in this movie. The combo scenes by Basil Joseph and Vineeth Sreenivasan was awesome.",
            "content_html": "<h4 id=\"1-purusha-pretham\">1. Purusha Pretham</h4><p>Krishand’s <a href=\"https://boxd.it/EkO0\"><em>Purusha Pretham</em></a> will undoubtedly take first place on my list. I loved his previous work <em>Aavasavyuham</em> and when he announced Purusha Pretham, my expectations where high.The movie is  experimental in many ways, like the cinematography, story telling,music etc and the makers succeeded in not boring the audience. The performances by Jagadish and Prasanth Alexander were outstanding.</p><h4 id=\"2-kannur-squad\">2. Kannur Squad</h4><p>Mammootty Kampany, the production house by the legendary actor Mammootty, had  only produced two films before this film and their previous productions where well-accepted by the audience.  Their third film, <a href=\"https://boxd.it/EkOu\"><em>Kannur Squad</em></a>, which came to cinemas with low hype became a blockbuster at the box-office through word of mouth. Roby Raj’s directorial debut, which is based on Kerala Police’s investigation team Kannur Squad is a well made movie with superb cinematography and background music. I watched the film in theatres and the experience was good.</p><h4 id=\"3-iratta\">3. Iratta</h4><p><a href=\"https://boxd.it/zELA\"><em>Iratta</em></a> is an investigative thriller  directed by Rohith Krishnan which amused me by its climax. Joju George as an actor gives a terrific performance in this film. The ending is the major positive of the movie. The film didn’t get a long run in the theatres and failed at the box-office is a sad part. This film deserved much more success in the theatre.</p><h4 id=\"4-falimy\">4. Falimy</h4><p>I loved <a href=\"https://boxd.it/DwWe\"><em>Falimy</em></a>, its a simple yet beautiful film with many laughable moments. Jagadish, Basil, Manju Pillai and that Appooppan everyone did a great job in entertaining the audience in this movie.</p><h4 id=\"5-pookkaalam\">5. Pookkaalam</h4><p>Ganesh Raj’s <a href=\"https://boxd.it/Bm8O\"><em>Pookkaalam</em></a> is a small movie which loved for its simplicity. Vijayaraghavan did an amazing performance in this movie. The combo scenes by Basil Joseph and Vineeth Sreenivasan was awesome.</p>",
            "url": "http://localhost:4000/fav-malayalam-movies-of-2023/",
            
            
            
            "tags": ["blog","movies"],
            
            "date_published": "2023-12-29T05:30:00+05:30",
            "date_modified": "2023-12-29T05:30:00+05:30",
            
                "author": "Abhijith"
            
        }
    
    ]
}